;;; pyim-pymap.el --- Pinyin map used by pyim  -*- lexical-binding: t; -*-

;; * Header
;; Copyright (C) 2015-2020 Free Software Foundation, Inc.

;; Author: Feng Shu <tumashu@163.com>
;; Maintainer: Feng Shu <tumashu@163.com>
;; URL: https://github.com/tumashu/pyim
;; Keywords: convenience, Chinese, pinyin, input-method

;; This file is part of GNU Emacs.

;; GNU Emacs is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; GNU Emacs is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; * 说明文档                                                              :doc:

;; 这个文件源自：[[http://git.savannah.gnu.org/cgit/emacs.git/tree/leim/MISC-DIC/pinyin.map][pinyin.map]]
;; 这个文件是 pyim 内部使用的 "拼音-汉字" 对照表，
;; 这个对照表用来实现拼音查询功能，即，查询某个汉字对应的拼音代码。

;; 注意： 这个文件 *不用于* 输入法自定义词库！！！


;;; Code:
;; * 代码                                                                 :code:
(defvar pyim-pymap
  '(("a" "阿啊呵腌嗄锕吖")
    ("ai" "爱哀挨碍埃癌艾唉矮哎皑蔼隘暧霭捱嗳瑷嫒锿嗌砹")
    ("an" "安案按暗岸俺谙黯鞍氨庵桉鹌胺铵揞犴埯")
    ("ang" "昂肮盎")
    ("ao" "奥澳傲熬敖凹袄懊坳嗷拗鏖骜鳌翱岙廒遨獒聱媪螯鏊")
    ("ba" "把八吧巴爸罢拔叭芭霸靶扒疤跋坝笆耙粑灞茇菝魃岜捌钯鲅")
    ("bai" "百白败摆伯拜柏呗掰捭佰稗")
    ("ban" "办半版般班板伴搬扮斑颁瓣拌扳绊阪坂瘢钣舨癍")
    ("bang" "帮邦棒膀榜傍绑磅谤浜梆镑蚌蒡")
    ("bao" "报保包暴宝抱薄胞爆鲍饱堡曝刨褒豹雹苞葆褓孢煲鸨龅趵")
    ("bei" "被北备背悲辈杯倍贝碑卑蓓惫悖狈呗焙鹎孛邶陂埤碚褙鐾鞴萆钡")
    ("ben" "本奔笨苯夯畚贲锛坌")
    ("beng" "崩甭绷蹦迸甏泵嘣蚌")
    ("bi" "比必笔毕币避闭鼻彼逼壁臂弊碧鄙毙蔽庇匕璧敝陛弼篦婢愎痹妣濞铋裨俾髀萆薜哔狴庳秕滗舭毖吡嬖蓖贲畀荸埤筚箅芘襞跸荜")
    ("bian" "编便边变遍辩辨贬鞭辫扁卞砭苄匾汴蝙笾碥窆褊弁鳊忭煸缏")
    ("biao" "表标彪镖膘骠镳裱杓飙瘭髟飚婊飑鳔")
    ("bie" "别憋瘪蹩鳖")
    ("bin" "宾滨彬斌鬓缤殡濒槟摈膑傧玢豳髌镔")
    ("bing" "并病兵冰饼丙柄秉炳禀邴摒")
    ("bo" "波播博伯勃薄拨泊柏剥玻驳卜脖搏膊饽簸掰舶跛礴菠帛铂钵渤檗钹擘箔趵孛鹁踣亳啵")
    ("bu" "不部布步补捕怖卜簿哺埔卟埠钸逋醭晡瓿钚")
    ("ca" "擦嚓礤")
    ("cai" "才采菜财材彩裁猜蔡踩睬")
    ("can" "参餐残惨灿惭掺蚕璨孱骖黪粲")
    ("cang" "藏苍仓沧舱伧")
    ("cao" "草操曹糙嘈槽螬艚漕")
    ("ce" "策测侧厕册恻")
    ("cen" "参岑涔")
    ("ceng" "曾层蹭噌")
    ("cha" "查察差茶插刹叉诧茬碴喳岔嚓衩杈楂槎檫镲搽锸猹馇汊姹")
    ("chai" "差柴拆豺钗侪虿瘥")
    ("chan" "产颤缠禅蝉馋铲搀阐掺潺忏蟾婵谄谗廛孱澶冁躔蒇骣觇镡羼")
    ("chang" "长场常唱厂尝昌肠偿畅倡倘敞怅娼猖嫦伥氅徜昶鲳阊菖苌鬯惝")
    ("chao" "超朝潮炒吵抄嘲钞绰巢晁焯怊耖")
    ("che" "车彻撤扯澈掣坼砗")
    ("chen" "称陈沉晨尘臣趁衬辰郴谶琛忱嗔伧抻谌宸榇龀碜")
    ("cheng" "成城程称承诚盛乘呈撑惩澄秤瞠橙噌逞铛丞骋埕枨塍铖裎酲柽蛏")
    ("chi" "吃持迟尺赤斥池痴齿驰耻翅匙侈哧嗤啻弛蚩炽笞敕叱饬踟鸱褫豉坻墀茌篪傺媸螭彳眵魑瘛")
    ("chong" "重冲充崇虫宠憧忡艟茺舂铳")
    ("chou" "抽愁仇丑筹臭酬绸踌瞅惆畴稠雠俦帱瘳")
    ("chu" "出处除初楚触储础厨畜躇橱雏矗怵锄杵搐绌黜褚蜍蹰刍滁楮憷亍樗")
    ("chuai" "揣啜踹嘬膪搋")
    ("chuan" "传穿川船串喘舛遄舡巛氚椽钏")
    ("chuang" "创窗床闯幢疮怆")
    ("chui" "吹垂炊锤捶陲槌棰")
    ("chun" "春纯唇蠢醇淳椿鹑蝽莼")
    ("chuo" "绰戳啜辍踔龊")
    ("ci" "此次词差刺辞慈磁赐瓷兹茨雌祠疵呲鹚糍茈")
    ("cong" "从匆聪丛葱囱琮淙枞苁骢璁")
    ("cou" "凑楱辏腠")
    ("cu" "促粗簇醋卒猝蹴蹙徂殂蔟酢")
    ("cuan" "攒窜篡蹿撺镩汆爨")
    ("cui" "脆粹催摧崔萃翠瘁悴璀隹淬毳榱啐")
    ("cun" "存村寸忖皴")
    ("cuo" "错措搓挫撮磋蹉矬嵯脞痤瘥鹾厝锉")
    ("da" "大打达答搭瘩嗒沓耷褡鞑笪靼怛妲哒疸")
    ("dai" "代带待戴袋呆贷逮歹殆黛怠玳岱迨傣呔骀绐埭甙")
    ("dan" "但单担弹淡旦蛋胆诞丹耽惮眈啖澹掸殚箪瘅赕疸聃氮萏郸儋")
    ("dang" "当党荡档挡裆铛宕凼菪谠砀")
    ("dao" "到道导倒岛刀悼盗蹈捣祷叨稻忉帱氘纛")
    ("de" "的得德锝")
    ("deng" "等登灯邓凳瞪蹬噔磴戥镫簦嶝")
    ("di" "地第提底低帝弟敌抵递滴迪蒂堤笛缔涤嘀诋谛狄邸睇嫡翟砥娣棣荻羝坻柢觌骶氐绨镝碲籴")
    ("dia" "嗲")
    ("dian" "点电店典颠甸淀垫殿滇奠惦掂碘癫巅踮佃玷簟阽坫靛钿癜丶")
    ("diao" "调掉吊雕刁钓凋叼貂碉铫铞鲷")
    ("die" "爹跌叠迭碟谍蝶喋佚踮牒耋蹀堞瓞揲垤鲽")
    ("ding" "定订顶丁盯钉鼎叮町铤腚酊仃锭疔啶玎碇耵")
    ("diu" "丢铥")
    ("dong" "动东懂冬洞冻董栋咚恫侗氡硐鸫岽垌峒胨胴")
    ("dou" "都斗豆抖逗兜陡窦蔸蚪篼痘")
    ("du" "都读度独毒督渡肚杜睹堵赌妒嘟渎笃牍镀犊黩髑椟芏蠹")
    ("duan" "断段短端锻缎煅椴簖")
    ("dui" "对队堆兑碓憝怼镦")
    ("dun" "顿盾吨敦蹲钝炖遁盹沌囤墩趸镦礅砘")
    ("duo" "多夺朵躲舵堕踱咄跺哆剁惰垛驮掇铎裰哚缍沲柁")
    ("e" "额俄恶饿哦鹅扼愕遏噩娥峨呃厄鄂讹婀蛾轭颚鳄锷谔屙锇阏垩腭苊鹗萼莪")
    ("ei" "诶")
    ("en" "恩摁蒽")
    ("er" "而二儿尔耳迩饵洱鸸珥铒鲕贰佴")
    ("fa" "发法罚乏伐阀砝筏垡珐")
    ("fan" "反饭犯翻范凡烦返番贩繁泛帆藩幡梵樊燔蕃畈钒蘩矾蹯")
    ("fang" "方放房访防仿芳妨纺彷坊肪舫钫鲂邡枋")
    ("fei" "非费飞废肥啡沸菲肺匪诽腓扉吠霏绯妃斐翡蜚痱淝悱鲱篚芾狒镄榧")
    ("fen" "分份纷奋愤粉氛芬坟焚粪忿吩汾棼鼢玢酚偾瀵鲼")
    ("feng" "风封丰峰疯锋逢奉缝凤讽冯蜂枫烽俸砜唪酆葑沣")
    ("fo" "佛")
    ("fou" "否缶")
    ("fu" "夫府服复父负副福富付妇附佛幅伏符赴腐浮扶腹抚覆肤赋弗傅辅拂甫俯斧缚咐脯袱俘敷阜芙釜孚腑匐孵辐涪讣氟桴蜉芾苻茯莩菔幞怫拊滏黼艴麸绂绋趺祓砩黻罘蚨跗蝠呋凫郛稃驸赙馥蝮鲋鳆")
    ("ga" "咖尬嘎噶轧伽旮钆尕尜")
    ("gai" "改该概盖丐钙赅溉垓陔戤")
    ("gan" "感干敢赶甘肝杆尴赣橄竿秆擀坩苷柑泔矸澉疳酐淦绀旰")
    ("gang" "刚港钢岗纲缸扛杠冈肛罡戆筻")
    ("gao" "高告稿搞糕膏皋羔睾槁藁缟篙镐诰槔杲郜锆")
    ("ge" "个革各歌格哥戈隔葛割阁胳搁疙咯鸽嗝骼颌屹搿膈镉纥袼仡鬲塥圪哿舸铬硌虼")
    ("gei" "给")
    ("gen" "根跟亘艮哏茛")
    ("geng" "更耿耕颈庚羹梗哽赓鲠埂绠")
    ("gong" "工公共供功攻宫贡恭巩躬龚弓拱肱汞蚣珙觥")
    ("gou" "够购构狗沟勾苟钩觏篝垢佝岣诟鞲笱枸遘媾缑彀")
    ("gu" "故古顾股鼓姑骨固孤谷估雇辜咕沽箍菇汩轱锢蛊梏鸪毂鹄臌瞽罟钴觚鹘菰蛄嘏诂崮酤牿牯痼鲴")
    ("gua" "挂瓜刮寡呱褂卦剐鸹栝胍诖")
    ("guai" "怪乖拐掴")
    ("guan" "关观管官馆惯冠贯罐灌棺莞倌纶掼盥涫鳏鹳")
    ("guang" "广光逛犷咣胱桄")
    ("gui" "规归贵鬼桂跪柜轨瑰诡刽龟硅闺皈傀癸圭晷簋妫鲑匦庋宄炔刿桧炅鳜")
    ("gun" "滚棍鲧绲磙辊衮")
    ("guo" "国过果锅郭裹帼蝈聒馘掴埚虢呙崞猓椁蜾")
    ("ha" "哈蛤铪")
    ("hai" "还海孩害嘿咳亥骇骸嗨胲醢氦")
    ("han" "汉喊含寒汗韩憾涵函翰撼罕旱捍酣悍憨晗瀚鼾顸阚焊蚶焓颔菡撖邗邯")
    ("hang" "行航巷杭夯沆颃绗珩")
    ("hao" "好号毫豪浩耗皓嚎昊郝壕蒿貉灏镐嗥嚆薅濠蚝颢")
    ("he" "和何合河喝赫核吓贺盒呵禾荷鹤壑阂褐诃涸阖嗬貉曷颌劾盍纥蚵翮菏")
    ("hei" "黑嘿嗨")
    ("hen" "很恨狠痕")
    ("heng" "横衡恒哼亨蘅珩桁")
    ("hong" "红轰洪鸿哄宏虹弘烘泓闳薨讧蕻訇黉荭")
    ("hou" "后候後厚侯喉吼猴逅糇骺堠瘊篌鲎")
    ("hu" "乎护呼胡户湖忽互糊虎壶狐沪惚浒唬葫弧蝴囫瑚斛祜猢鹄醐戽扈唿笏琥滹鹕轷烀冱岵怙鹘槲觳瓠鹱煳")
    ("hua" "话华化花划画滑哗桦猾砉铧骅")
    ("huai" "怀坏徊淮槐踝")
    ("huan" "欢换还环缓患幻唤宦焕痪寰鬟涣浣奂桓缳豢锾郇萑圜洹擐獾漶逭鲩")
    ("huang" "黄皇荒晃慌煌惶恍谎璜徨簧凰幌潢蝗蟥遑隍肓磺癀湟篁鳇")
    ("hui" "会回汇挥辉灰惠毁悔恢慧绘徽讳贿徊晦秽诲诙晖彗麾烩荟卉茴喙蛔恚洄珲蕙哕咴浍虺缋桧隳蟪")
    ("hun" "婚混魂昏浑馄荤诨溷阍珲")
    ("huo" "和或活火获货伙祸惑霍豁夥锪耠劐钬攉藿嚯镬蠖")
    ("ji" "几给己机记及计即基济辑级极寄际技集纪击奇急激继既积籍鸡吉挤迹季寂绩疾饥祭缉忌剂圾姬矶肌嫉讥藉叽脊冀稽妓棘骥畸蓟汲悸岌伎笈跻瘠亟诘暨霁羁稷偈戟嵇楫唧鲫髻荠箕觊蒺畿虮齑殛墼佶掎芨丌麂蕺咭嵴芰笄哜洎乩戢屐剞跽玑鲚赍犄")
    ("jia" "家加价假架甲佳驾夹嫁嘉贾稼茄佼挟颊皎侥枷珈戛迦伽浃痂胛笳荚葭钾镓嘏郏挢岬徼湫敫袈瘕恝铗袷蛱跏")
    ("jian" "见间件建简坚监减渐检健兼剑艰肩键荐尖鉴剪践奸捡箭舰拣贱溅煎俭槛碱歼缄茧笺柬谏蹇僭涧菅謇硷睑锏饯毽鲣鞯蒹搛谫囝湔缣枧戬戋犍裥笕翦趼楗牮鹣腱踺")
    ("jiang" "将讲强江奖降蒋疆酱姜浆僵匠犟缰绛桨耩礓洚豇茳糨")
    ("jiao" "教交觉校叫较角脚焦骄郊轿搅嚼胶缴绞饺椒矫娇佼狡浇跤姣窖剿侥皎蕉酵礁鲛徼湫敫僬鹪峤蛟铰艽茭挢噍醮")
    ("jie" "界解接结节街姐阶介借戒杰届皆捷截洁揭劫竭藉睫诫嗟拮孑碣秸诘桀芥偈颉讦疖疥婕羯鲒蚧骱喈")
    ("jin" "进今金近尽仅紧禁劲津斤谨锦筋晋巾浸襟瑾矜靳缙烬噤觐馑堇衿荩廑妗卺赆槿")
    ("jing" "经京精境警竟静惊景敬睛镜竞净井径晶荆兢颈憬靖鲸泾阱儆旌痉迳茎胫腈菁粳獍肼弪婧刭靓")
    ("jiong" "窘炯迥扃炅")
    ("jiu" "就九究酒久旧救纠揪疚舅韭赳鸠灸咎啾臼鹫阄僦厩玖柩桕鬏")
    ("ju" "局据居句举具剧巨聚拒俱距惧菊拘矩桔驹鞠咀沮瞿锯炬飓趄掬踽踞遽橘倨疽龃屦犋裾钜苴雎鞫椐讵苣锔狙榘莒枸榉窭醵琚")
    ("juan" "捐卷倦眷娟隽绢鹃涓镌锩鄄狷桊蠲")
    ("jue" "觉绝决脚嚼掘诀崛爵抉倔獗嗟厥蹶攫谲矍撅噱孓橛噘珏桷劂爝镢蕨觖")
    ("jun" "军均君俊峻钧隽筠菌郡骏竣麇皲捃浚")
    ("ka" "卡咖喀咔佧胩")
    ("kai" "开慨凯铠揩楷恺垲蒈锎剀锴忾")
    ("kan" "看刊侃堪砍坎槛勘瞰龛阚莰戡")
    ("kang" "抗康慷扛炕亢糠伉闶钪")
    ("kao" "考靠铐烤拷犒栲尻")
    ("ke" "可克科客刻课颗渴柯呵棵恪咳苛磕壳坷嗑瞌轲稞疴蝌溘髁钶窠颏珂岢骒缂氪锞蚵")
    ("ken" "肯恳啃垦龈裉")
    ("keng" "坑吭铿")
    ("kong" "空恐控孔倥崆箜")
    ("kou" "口扣抠寇叩蔻眍芤筘")
    ("ku" "苦哭库裤酷枯窟骷刳堀喾绔")
    ("kua" "夸跨垮挎胯侉")
    ("kuai" "会快块筷脍蒯哙侩狯浍郐")
    ("kuan" "款宽髋")
    ("kuang" "况狂矿框旷眶筐匡哐邝诓夼诳圹纩贶")
    ("kui" "亏愧溃窥魁馈睽盔逵葵奎匮傀喟聩岿馗夔篑喹悝暌隗蒉蝰愦揆跬")
    ("kun" "困昆捆坤鲲悃髡锟醌阃琨")
    ("kuo" "括阔扩廓栝蛞")
    ("la" "拉啦辣腊喇垃蜡剌邋旯瘌砬")
    ("lai" "来赖莱睐癞籁徕涞赉铼崃濑")
    ("lan" "兰蓝栏烂懒览滥拦篮揽澜榄婪缆斓岚阑褴镧罱谰漤")
    ("lang" "浪狼朗郎廊琅螂榔啷莨锒稂阆蒗")
    ("lao" "老劳牢捞姥佬潦唠烙酪涝崂痨醪铹栳铑耢")
    ("le" "了乐勒肋叻泐鳓仂")
    ("lei" "类泪累雷蕾垒磊擂肋儡羸诔镭嘞檑嫘缧酹耒")
    ("leng" "冷愣楞棱塄")
    ("li" "里理力利立李历离例礼丽励黎厉璃莉哩笠粒俐漓栗狸梨隶吏沥篱厘犁雳罹莅戾鲤俚砺藜俪蜊黧郦痢枥逦娌詈骊荔鳢喱鹂嫠蠡鬲鲡悝坜苈砾藓呖唳猁溧澧栎轹蓠傈缡疠疬蛎锂篥粝跞醴")
    ("lia" "俩")
    ("lian" "联连脸练恋怜莲廉炼帘链敛涟镰殓琏楝裢裣蠊鲢濂臁潋蔹奁")
    ("liang" "两量良亮辆梁俩凉粮谅粱晾踉莨墚魉椋靓")
    ("liao" "了料聊疗辽僚廖寥镣潦撩撂缭燎寮嘹钌獠鹩蓼尥")
    ("lie" "列烈裂劣猎咧趔冽洌捩埒躐鬣")
    ("lin" "林临邻琳淋霖麟凛吝鳞磷躏赁嶙辚檩遴粼蔺懔瞵啉膦廪")
    ("ling" "领令另灵零龄凌玲铃陵岭拎伶聆囹棱菱翎苓瓴棂绫呤柃鲮酃泠羚蛉")
    ("liu" "六留流陆刘溜柳碌瘤榴浏硫琉遛馏镏骝绺锍旒熘鎏鹨")
    ("long" "龙隆笼胧拢咙聋垄珑窿陇癃茏栊泷垅砻")
    ("lou" "楼陋漏搂喽篓偻娄髅蝼镂蒌嵝耧瘘")
    ("lu" "路陆录卢露鲁炉鹿碌庐芦噜颅禄辘卤虏麓泸赂漉戮簏轳鹭掳潞鲈撸栌垆胪蓼渌鸬逯璐辂橹镥舻氇")
    ("lv" "律旅绿率虑履屡侣缕驴吕榈滤捋铝褛闾膂氯稆")
    ("luan" "乱卵峦挛孪栾銮娈滦鸾脔")
    ("lue" "略掠锊")
    ("lun" "论轮伦沦仑抡囵纶")
    ("luo" "落罗络洛逻裸骆萝螺锣箩摞烙捋珞骡猡镙椤倮蠃荦瘰泺漯脶硌雒")
    ("m" "呒")
    ("ma" "马吗妈码麻骂嘛抹玛蚂蟆唛杩犸嬷")
    ("mai" "买卖麦埋迈脉霾劢荬")
    ("man" "满慢漫曼蛮馒瞒蔓颟谩墁幔螨鞔鳗缦熳镘")
    ("mang" "忙茫盲芒氓莽蟒邙漭硭")
    ("mao" "毛冒猫贸矛帽貌茅茂髦卯耄瑁锚懋袤铆峁牦蟊泖昴茆旄蝥瞀")
    ("me" "么麽")
    ("mei" "没美每妹眉梅媒枚魅煤昧霉玫媚寐糜袂酶莓嵋楣湄猸镅浼鹛镁")
    ("men" "们门闷扪懑焖钔")
    ("meng" "梦蒙猛盟朦孟萌勐懵檬蠓瞢甍礞蜢虻艋艨锰")
    ("mi" "密米秘迷弥谜觅眯蜜靡咪谧泌糜汨宓麋醚弭敉芈祢脒幂縻嘧蘼猕糸")
    ("mian" "面免棉眠缅绵勉腼冕娩湎沔眄黾渑")
    ("miao" "妙描秒庙苗渺瞄藐缪淼缈喵眇邈鹋杪")
    ("mie" "灭蔑篾咩乜蠛")
    ("min" "民敏悯闽泯珉皿抿闵苠岷缗玟愍黾鳘")
    ("ming" "名明命鸣铭冥茗溟酩瞑暝螟")
    ("miu" "谬缪")
    ("mo" "默莫模麽末磨摸摩寞漠墨抹魔陌嘿沫膜蓦蘑茉馍摹貉谟嫫秣镆殁瘼耱貊貘")
    ("mou" "某谋眸缪鍪哞侔蛑")
    ("mu" "目母木幕姆慕牧墓募暮牟亩穆睦拇沐牡仫坶苜毪钼")
    ("n" "嗯唔")
    ("na" "那拿呢哪纳娜呐捺钠镎肭衲")
    ("nai" "乃奶奈耐氖艿鼐佴萘柰")
    ("nan" "难南男楠喃囡囝腩蝻赧")
    ("nang" "囊囔馕攮曩")
    ("nao" "脑闹恼挠瑙淖呶猱铙孬硇蛲垴")
    ("ne" "呢讷")
    ("nei" "内馁")
    ("nen" "嫩恁")
    ("neng" "能")
    ("ng" "嗯唔")
    ("ni" "你呢尼泥逆倪匿拟腻妮霓昵溺旎睨鲵坭猊怩伲祢慝铌")
    ("nian" "年念廿粘碾捻蔫撵拈黏鲶鲇辇埝")
    ("niang" "娘酿")
    ("niao" "鸟尿袅嬲茑脲")
    ("nie" "捏涅聂孽蹑嗫啮镊镍乜陧颞臬蘖")
    ("nin" "您恁")
    ("ning" "宁凝拧泞咛狞柠佞聍苎甯")
    ("niu" "牛纽扭妞钮拗忸狃")
    ("nong" "农弄浓侬哝脓")
    ("nou" "耨")
    ("nu" "怒努奴弩驽胬孥")
    ("nv" "女钕恧衄")
    ("nuan" "暖")
    ("nue" "虐疟")
    ("nuo" "诺挪懦糯喏搦傩锘")
    ("o" "哦噢喔")
    ("ou" "欧偶殴呕鸥讴瓯藕沤耦怄")
    ("pa" "怕爬帕扒趴啪琶葩耙杷钯筢")
    ("pai" "派排牌拍徘湃俳蒎哌")
    ("pan" "判盘盼叛畔潘攀拚蹒磐爿蟠襻袢泮")
    ("pang" "旁庞胖乓膀磅彷螃滂耪逄")
    ("pao" "跑炮抛泡袍刨咆狍疱脬庖匏")
    ("pei" "配陪培佩赔沛裴呸胚醅锫辔帔旆霈")
    ("pen" "盆喷湓")
    ("peng" "朋鹏碰彭捧棚蓬膨烹抨篷砰澎怦堋蟛嘭硼")
    ("pi" "批否皮屁披疲辟啤脾匹僻劈譬坯痞癖琵毗霹噼媲郫裨纰丕鼙圮蚍蜱貔陂陴砒仳埤擗吡庀邳疋芘枇罴淠铍甓睥")
    ("pian" "便片篇偏骗翩扁犏谝蹁骈缏胼")
    ("piao" "票漂飘瓢嫖瞟骠嘌剽螵缥莩殍")
    ("pie" "撇瞥氕丿苤")
    ("pin" "品贫拼频聘拚姘嫔榀颦牝")
    ("ping" "平评瓶凭萍乒屏苹坪枰娉俜鲆")
    ("po" "破迫颇婆坡泊泼魄粕珀叵攴钷笸钋陂泺鄱皤")
    ("pou" "剖裒掊")
    ("pu" "普铺扑朴谱浦葡蒲仆脯瀑菩溥匍璞噗圃埔氆镨蹼镤濮莆")
    ("qi" "起其期气七奇妻企器汽棋齐旗弃启骑欺歧岂戚凄泣契琪乞祈漆迄脐栖沏祺崎祁琦蹊砌憩淇汔亟绮讫嘁岐萋俟杞芪荠耆槭颀芑屺欹桤綮萁蛴蜞綦鳍麒蕲柒亓骐葺畦圻碛")
    ("qia" "恰洽掐伽袷葜髂")
    ("qian" "前钱千签欠牵浅潜迁谦遣歉纤嵌乾谴铅虔钳骞倩堑黔掮悭芊缱愆荨芡阡佥搴褰肷钎仟犍钤岍箝鬈扦慊椠")
    ("qiang" "强枪墙抢腔呛锵跄羌蔷戕襁樯炝蜣嫱锖戗羟镪")
    ("qiao" "桥悄乔巧侨瞧敲翘俏窍峭锹撬跷憔樵鞘橇诮愀谯荞峤缲硗鞒劁")
    ("qie" "切且窃怯茄趄妾砌惬伽锲挈郄箧慊")
    ("qin" "亲钦琴侵秦勤芹擒寝覃沁禽噙揿檎锓芩嗪螓衾廑溱吣")
    ("qing" "情请青清轻晴庆倾卿擎顷氢罄蜻磬謦苘圊檠黥鲭氰箐綮")
    ("qiong" "穷琼穹茕邛蛩筇跫銎")
    ("qiu" "求球秋邱囚丘酋蚯裘俅虬鳅逑遒赇泅楸犰湫蝤巯鼽糗")
    ("qu" "去取区曲趣屈趋驱渠躯娶觑瞿岖戌蛐衢蛆癯麴阒祛磲鸲诎蠼劬蕖蘧龋苣黢璩氍朐")
    ("quan" "全权圈劝泉券拳犬诠颧蜷绻荃铨痊鬈辁悛畎醛筌")
    ("que" "却确缺雀瘸榷鹊阕阙炔悫")
    ("qun" "群裙逡麇")
    ("ran" "然染燃冉髯苒蚺")
    ("rang" "让嚷攘壤瓤穰禳")
    ("rao" "扰绕饶娆桡荛")
    ("re" "热惹喏")
    ("ren" "人任认忍仁韧刃纫饪壬仞稔葚荏妊轫衽")
    ("reng" "仍扔")
    ("ri" "日")
    ("rong" "容荣融蓉溶绒熔榕戎嵘茸冗肜蝾狨")
    ("rou" "肉柔揉蹂鞣糅")
    ("ru" "如入辱儒乳汝褥嚅茹濡蠕孺缛襦颥薷蓐洳溽铷")
    ("ruan" "软阮朊")
    ("rui" "瑞锐芮睿蕤枘蕊蚋")
    ("run" "润闰")
    ("ruo" "若弱偌箬")
    ("sa" "洒撒萨卅仨飒挲脎")
    ("sai" "赛塞腮噻鳃")
    ("san" "三散伞叁毵馓糁霰")
    ("sang" "丧桑嗓搡磉颡")
    ("sao" "扫骚嫂梢臊搔缲缫鳋埽瘙")
    ("se" "色塞涩瑟啬铯穑")
    ("sen" "森")
    ("seng" "僧")
    ("sha" "杀沙啥傻厦刹纱莎煞砂霎嗄挲歃鲨唼痧裟铩")
    ("shai" "晒筛酾")
    ("shan" "山善闪衫删煽扇陕珊杉擅掺膳栅讪跚汕姗赡潸缮嬗掸膻骟芟埏剡钐鄯舢苫髟疝蟮鳝")
    ("shang" "上商伤尚赏殇裳晌觞熵墒绱垧")
    ("shao" "少绍烧稍勺哨邵梢捎韶苕鞘潲劭杓芍蛸筲艄")
    ("she" "社设舍涉射摄舌蛇奢赦慑佘赊麝畲厍滠歙猞")
    ("shei" "谁")
    ("shen" "什身深神参甚申审沈伸慎渗绅肾呻婶莘蜃葚娠渖矧诜砷糁谂椹胂哂")
    ("sheng" "生声省胜升圣盛剩牲绳甥笙渑眚嵊晟")
    ("shi" "是时十事实使世市识始士师诗式失史视示食室势试石释施适氏驶饰尸拾逝湿誓狮嗜蚀嘘屎侍匙峙仕恃柿轼矢噬拭虱弑蓍埘莳炻谥鲥豕贳铈螫舐筮鲺酾")
    ("shou" "手受收首授守售瘦寿兽狩绶艏")
    ("shu" "书数术属输树述熟束署殊舒叔鼠疏淑抒薯梳暑竖蜀恕墅孰漱枢俞赎黍蔬曙倏庶戍塾澍姝纾秫毹殳疋菽丨沭摅腧")
    ("shua" "刷耍唰")
    ("shuai" "率衰摔甩帅蟀")
    ("shuan" "涮栓拴闩")
    ("shuang" "双爽霜孀泷")
    ("shui" "水谁税睡")
    ("shun" "顺舜瞬吮")
    ("shuo" "说朔硕烁铄妁蒴槊搠")
    ("si" "四死思斯司似私丝寺撕肆厮嘶伺饲嗣祀巳驷鸶俟汜泗厶兕蛳咝姒澌缌耜笥锶")
    ("song" "送松宋诵耸颂讼悚怂忪淞菘崧嵩凇竦")
    ("sou" "搜艘嗽擞馊薮嗾叟嗖溲飕锼瞍螋")
    ("su" "苏诉速素俗肃宿塑稣溯酥粟簌夙嗉谡僳愫涑蔌觫")
    ("suan" "算酸蒜狻")
    ("sui" "岁随虽碎遂祟隧髓邃穗隋绥睢荽燧谇眭濉")
    ("sun" "孙损笋荪狲飧榫隼")
    ("suo" "所索缩锁琐梭嗦唆挲娑睃唢嗍蓑羧桫")
    ("ta" "他她它踏塔塌榻嗒蹋沓遢挞鳎闼铊趿漯溻獭")
    ("tai" "太台态泰抬胎汰苔呔鲐邰薹酞骀炱跆肽钛")
    ("tan" "谈探弹坦叹坛摊贪滩毯谭潭瘫炭覃痰忐坍袒碳澹檀昙镡郯锬钽")
    ("tang" "堂唐汤躺糖趟倘烫淌膛塘棠搪溏螳瑭樘螗铴醣镗耥饧傥帑羰")
    ("tao" "讨套逃涛掏陶桃淘滔萄焘啕韬饕洮绦鼗")
    ("te" "特忑忒慝铽")
    ("tei" "忒")
    ("teng" "腾疼藤誊滕")
    ("ti" "体提题替踢梯啼涕蹄剔剃惕屉嚏悌醍缇鹈锑荑倜绨逖裼")
    ("tian" "天田填甜添腆舔恬钿阗畋忝殄掭")
    ("tiao" "条调跳挑迢眺鲦佻苕窕髫粜笤龆祧蜩")
    ("tie" "铁贴帖餮萜")
    ("ting" "听停庭厅挺亭婷廷艇町霆汀铤蜓莛梃葶烃")
    ("tong" "同通统痛童彤筒铜桶捅桐瞳佟恸酮恫侗砼嗵仝垌茼峒潼")
    ("tou" "头投偷透钭骰")
    ("tu" "土突图途徒屠涂吐兔秃凸荼酴钍菟堍")
    ("tuan" "团湍抟疃彖")
    ("tui" "推退腿褪颓蜕忒煺")
    ("tun" "吞屯饨褪臀囤豚暾氽")
    ("tuo" "托脱拖妥拓陀驼唾椭砣驮沱跎坨鸵乇鼍橐佗庹铊酡柁柝箨")
    ("wa" "瓦挖袜娃哇凹娲蛙洼佤腽")
    ("wai" "外歪崴")
    ("wan" "万完晚湾玩碗弯挽顽腕婉惋宛丸蜿莞畹剜豌皖纨琬脘烷芄菀绾")
    ("wang" "望王往网忘亡汪旺枉妄惘罔尢辋魍")
    ("wei" "为位未委维味围卫威微伟谓唯危慰尾违魏玮蔚伪畏胃喂炜韦惟巍纬萎娓苇尉帷渭猥偎薇痿猬逶帏韪煨鲔桅潍隈圩囗诿隗崴洧葳嵬闱沩涠艉軎")
    ("wen" "文问闻温稳吻纹蚊雯紊瘟汶刎阌璺")
    ("weng" "翁瓮嗡蓊蕹")
    ("wo" "我握窝卧渥沃涡斡蜗幄喔倭挝莴肟硪龌")
    ("wu" "无五物务武午舞於误恶吴屋伍悟吾污乌雾侮捂巫毋呜诬勿梧坞戊兀唔晤芜鹜钨妩痦鹉忤寤骛邬牾鼯圬浯仵阢芴庑婺怃杌焐蜈迕鋈")
    ("xi" "西系息希喜席习细戏吸洗惜稀悉析夕牺袭昔熙兮溪隙嘻锡晰媳樨熄膝郗犀禧曦奚羲蹊唏淅嬉皙汐徙茜玺熹烯翕蟋屣檄浠僖穸蜥隰觋螅铣菥葸蓰舾矽粞硒醯欷鼷歙饩阋禊舄")
    ("xia" "下夏吓峡厦侠狭霞瞎暇虾唬辖遐匣黠瑕呷狎柙硖瘕罅")
    ("xian" "现先显线险限县鲜献闲宪陷贤仙嫌咸羡掀弦纤娴衔馅涎舷腺跣暹岘猃蚬筅跹莶锨鹇痫铣氙祆籼冼藓酰苋燹霰")
    ("xiang" "想相向象香乡像响项享降箱详祥巷厢湘橡翔镶飨襄饷骧葙庠鲞芗缃蟓")
    ("xiao" "小笑校消效晓销潇肖萧孝宵削嚣啸逍硝霄淆哮枭骁箫筱哓枵绡魈蛸崤")
    ("xie" "些写谢协鞋携斜泄胁歇谐邪械屑卸挟懈泻亵蟹偕邂榭撷楔瀣蝎颉勰薤燮躞缬獬绁廨榍渫")
    ("xin" "心新信欣辛薪馨鑫芯衅昕忻锌歆镡囟")
    ("xing" "行性形兴星型姓幸刑醒腥杏悻惺邢猩荇擤荥饧硎陉")
    ("xiong" "雄兄胸凶熊匈汹芎")
    ("xiu" "修休秀袖宿臭羞绣朽锈嗅咻貅髹馐庥鸺岫溴")
    ("xu" "许续需须徐序虚绪吁蓄叙畜嘘恤絮浒墟旭婿栩戌诩胥酗煦砉盱糈醑顼勖洫溆圩蓿")
    ("xuan" "选宣旋悬券喧轩玄炫渲绚眩萱漩暄璇谖铉儇痃泫煊楦癣碹揎镟")
    ("xue" "学血雪削穴谑靴薛踅噱泶鳕")
    ("xun" "寻询训迅讯巡逊循旬熏勋驯荤殉醺巽徇埙荀峋洵薰汛郇曛窨恂獯浔鲟蕈浚")
    ("ya" "亚压雅牙呀押涯讶鸦哑鸭崖丫芽衙轧痖睚娅蚜伢疋岈琊垭揠迓桠氩砑")
    ("yan" "眼言严演研烟验延沿掩颜厌炎燕阎宴盐咽岩雁焰艳焉淹衍阉奄谚俨檐蜒彦腌焱晏唁妍砚嫣胭湮筵堰赝餍鼹芫偃魇闫崦厣剡恹阏兖郾琰罨鄢谳滟阽鼽酽菸")
    ("yang" "样洋阳央杨养扬仰羊痒漾泱氧鸯秧殃恙疡烊佯鞅怏徉炀蛘")
    ("yao" "要摇药耀遥邀腰姚咬尧谣瑶窑夭肴妖吆钥侥杳窈鹞曜舀铫幺爻徭繇鳐珧轺崾")
    ("ye" "也业夜爷叶野页液耶咽曳拽揶噎烨冶椰掖腋谒邺靥晔铘")
    ("yi" "一以意已义议医易衣艺依译移异益亦亿疑遗忆宜椅伊仪谊抑翼矣役艾乙溢毅蛇裔逸姨夷轶怡蚁弈倚翌颐疫绎彝咦佚奕熠贻漪诣迤弋懿呓驿咿揖旖屹痍薏噫镒刈沂臆缢邑胰猗羿钇舣劓仡酏佾埸诒圯荑壹挹嶷饴嗌峄怿悒铱欹殪黟苡肄镱瘗癔翊蜴眙翳燱")
    ("yin" "因音引印银隐饮阴姻瘾吟寅殷淫茵荫尹蚓垠喑湮胤鄞氤霪圻铟狺吲夤堙龈洇茚窨")
    ("ying" "应英影营迎硬映赢盈颖鹰婴蝇樱莹荧膺萤萦莺罂瀛楹缨颍嬴鹦瑛茔嘤璎荥撄郢瘿蓥滢潆媵")
    ("yo" "哟唷")
    ("yong" "用永拥勇涌踊泳庸佣咏俑雍恿甬臃邕镛痈壅鳙饔喁墉蛹慵")
    ("you" "有又由友游右油优邮幽尤忧犹悠幼诱佑黝攸呦酉柚鱿莠囿鼬铀卣猷牖铕疣蚰蝣釉蝤繇莜侑莸宥蚴尢")
    ("yu" "于与语育余遇狱雨於欲预予鱼玉愈域誉吁宇寓豫愚舆粥郁喻羽娱裕愉禹浴馀御逾渔渝俞萸瑜隅驭迂揄圄谕榆屿淤毓虞禺谀妪腴峪竽芋妤臾欤龉觎盂昱煜熨燠窬蝓嵛狳伛俣舁圉庾菀蓣饫阈鬻瘐窳雩瘀纡聿钰鹆鹬蜮")
    ("yuan" "员元原院远愿园源圆怨缘援冤袁渊苑猿鸳辕垣媛沅橼芫爰螈鼋眢圜鸢箢塬垸掾瑗")
    ("yue" "月乐越约阅跃曰悦岳粤钥刖瀹栎樾龠钺")
    ("yun" "运云允韵晕孕匀蕴酝筠芸耘陨纭殒愠氲狁熨郓恽昀韫郧")
    ("za" "杂扎砸咋咂匝拶")
    ("zai" "在再载灾仔宰哉栽崽甾")
    ("zan" "咱赞暂攒簪糌瓒拶昝趱錾")
    ("zang" "藏脏葬赃臧锗奘驵")
    ("zao" "早造遭糟澡灶躁噪凿枣皂燥蚤藻缲唣")
    ("ze" "则责泽择咋啧仄迮笮箦舴帻赜昃")
    ("zei" "贼")
    ("zen" "怎谮")
    ("zeng" "增赠憎缯罾甑锃")
    ("zha" "炸扎咋诈乍眨渣札栅轧闸榨喳揸柞楂哳吒铡砟齄咤痄蚱")
    ("zhai" "摘债宅窄斋寨翟砦瘵")
    ("zhan" "战展站占沾斩辗粘盏崭瞻绽蘸湛詹毡栈谵搌旃")
    ("zhang" "长张章丈掌涨帐障账胀仗杖彰璋蟑樟瘴漳嶂鄣獐仉幛嫜")
    ("zhao" "着找照招朝赵召罩兆昭肇沼诏钊啁棹笊")
    ("zhe" "这着者折哲浙遮辙辄谪蔗蛰褶鹧锗磔摺蜇赭柘")
    ("zhen" "真阵镇震针珍圳振诊枕斟贞侦赈甄臻箴疹砧桢缜畛轸胗稹祯浈溱蓁椹榛朕鸩")
    ("zheng" "政正证整争征挣郑症睁徵蒸怔筝拯铮峥狰诤鲭钲帧")
    ("zhi" "之只知至制直治指支志职致值织纸止质执智置址枝秩植旨滞徵帜稚挚汁掷殖芝吱肢脂峙侄窒蜘趾炙痔咫芷栉枳踯桎帙栀祉轾贽痣豸卮轵埴陟郅黹忮彘骘酯摭絷跖膣雉鸷胝蛭踬祗觯")
    ("zhong" "中种重众终钟忠衷肿仲锺踵盅冢忪舯螽")
    ("zhou" "周州洲粥舟皱骤轴宙咒昼肘帚胄纣诌绉妯碡啁荮籀繇酎")
    ("zhu" "主住注助著逐诸朱驻珠祝猪筑竹煮嘱柱烛铸株瞩蛛伫拄贮洙诛褚铢箸蛀茱炷躅竺杼翥渚潴麈槠橥苎侏瘃疰邾舳")
    ("zhua" "抓爪")
    ("zhuai" "拽嘬")
    ("zhuan" "传专转赚撰砖篆啭馔颛")
    ("zhuang" "装状壮庄撞妆幢桩奘僮戆")
    ("zhui" "追坠缀锥赘隹椎惴骓缒")
    ("zhun" "准谆窀肫")
    ("zhuo" "着桌捉卓琢灼酌拙浊濯茁啄斫镯涿焯浞倬禚诼擢")
    ("zi" "子自字资咨紫滋仔姿吱兹孜梓渍籽姊恣滓谘龇秭呲辎锱眦笫髭淄茈觜訾缁耔鲻嵫赀孳粢趑")
    ("zong" "总宗纵踪综棕粽鬃偬腙枞")
    ("zou" "走奏邹揍驺鲰诹陬鄹")
    ("zu" "组足族祖租阻卒诅俎镞菹")
    ("zuan" "赚钻攥纂躜缵")
    ("zui" "最罪嘴醉咀觜蕞")
    ("zun" "尊遵樽鳟撙")
    ("zuo" "作做坐座左昨琢佐凿撮柞嘬怍胙唑笮阼祚酢"))
  "拼音汉字对照表，第一个元素为拼音，第二个元素为拼音对应的汉字组成的字符串。")

(defvar pyim-pymap-commonly-used-cchar
  (remove "" (split-string "
乙二十丁厂七卜八人入儿匕几九刁了刀力乃又三干于亏工通土士才下寸大
丈与万上小口山巾千乞川亿个夕久么勺凡丸及广亡门丫义之尸己已用巳弓
子卫也女刃飞习叉马乡四丰王开井天夫元无云专丐扎艺木五支厅不犬太区
历规歹友尤匹车巨牙屯戈比互切瓦止少曰日中贝冈内水见午牛手气毛壬升
夭长仁什片一级画范仆化仇币仍仅斤爪反介父从仑今凶分乏公仓月氏勿欠
风丹匀乌勾凤六文亢方火为斗汉忆计订户认冗讥心尺引丑巴孔队办以允予
邓劝双书幻玉刊未末示击打巧正扑卉字表供扒功扔去甘世艾古节本术可丙
左厉石右布夯戊龙平灭轧东卡北占凸卢业旧帅归旦目且叶甲申叮电号田由
只叭史央兄叽叼叫叩叨另叹冉皿凹囚生矢失乍禾丘付仗代仙们仪白仔他斥
瓜乎丛令甩印尔乐句匆册卯犯外处冬鸟务包饥主市立冯玄闪兰半汁汇头宁
穴它讨写让礼训议必讯记永司尼民弗弘出辽奶奴召加皮边孕发圣对台矛纠
母幼丝邦式迂刑戎动扛寺吉扣考托老巩圾执扩扫地场扬耳芋共芒亚芝朽朴
机权过臣吏再协西压厌戌在百有存而页匠夸夺灰达列死成夹夷轨邪尧划迈
毕至此贞师尘尖劣光当早吁吐吓虫曲团吕同吊吃因吸吗吆屿屹岁帆回岂则
刚网肉年朱先丢廷舌竹迁乔迄伟传乒乓休伍伏优臼伐延仲件任伤价伦份华
仰仿伙伪自伊血向似后行舟全会杀合兆企众爷伞创肌肋朵杂危旬旨旭负匈
名各多争色壮冲妆冰庄庆亦刘齐交衣次产决亥充妄闭问闯羊并关米灯州汗
污江汛池汝汤忙兴宇守宅安讲讳军讶许讹论讼农讽设访诀寻那迅尽导异弛
孙阵阳收阶阴防奸如妇妃好她妈戏羽观欢买红驮纤驯约纪驰纫巡寿弄麦玖
玛形进戒吞远违韧运扶抚坛技坏抠扰扼拒找批址扯走抄贡汞坝攻赤折抓扳
抡扮抢孝坎均抑抛投坟坑抗坊抖护壳志块扭声把报拟却抒劫芙芜苇芽花芹
芥芬苍芳严芦芯劳克芭苏杆杠杜材村杖杏杉巫极李杨求甫匣更束吾豆两酉
丽医辰励否还尬歼来连轩步卤坚肖旱盯呈时吴助县里呆吱吠呕园旷围呀吨
足邮男困吵串员呐听吟吩呛吻吹呜吭吧邑吼囤别吮岖岗帐财针钉牡告我乱
利秃秀私每兵估体何佐佑但伸佃作伯伶佣低你住位伴身皂伺佛囱近彻役返
余希坐谷妥含邻岔肝肛肚肘肠龟甸免狂犹狈角删条彤卵灸岛刨迎饭饮系言
冻状亩况床库庇疗吝应这冷庐序辛弃冶忘闰闲间闷判兑灶灿灼弟汪沐沛汰
沥沙汽沃沦汹泛沧没沟沪沈沉沁怀忧忱快完宋宏牢究穷灾良证启评补初社
祀识诈诉罕诊词译君灵即层屁尿尾迟局改张忌际陆阿陈阻附坠妓妙妖姊妨
妒努忍劲矣鸡纬驱纯纱纲纳驳纵纷纸纹纺驴纽奉玩环武青责现玫抹卦坷坯
拓拢拔坪拣坦担坤押抽拐拖者拍顶拆拎拥抵拘势抱拄垃拉拦幸拌拧拂拙招
坡披拨择抬拇拗其取茉苦昔苛若茂苹苗英苟苑苞直茁茄茎苔茅枉林枝杯枢
柜枚析板松枪枫构杭杰述枕丧或卧事刺枣雨卖郁矾矿码厕奈奔奇奋态欧殴
垄妻轰顷转斩轮软到非叔歧肯齿些卓虎虏肾贤尚旺具味果昆国哎咕昌呵畅
明易咙昂迪典固忠呻咒咋咐呼鸣咏呢咄咖岸岩帖罗帜帕岭凯败账贩贬购贮
图钓制知迭氛垂牧物乖刮秆和季委秉佳侍岳使例侠侥版侄侦侣侧凭侨佩货
侈依卑的迫质欣征往爬彼径所舍金刹命肴斧爸采觅受乳贪念贫忿肤肺肢肿
胀朋股肮肪肥服胁周昏鱼兔狐忽狗狞备饰饱饲变京享庞店夜庙府底疟疙疚
剂卒郊庚废净盲放刻育氓闸闹郑券卷单炬炒炊炕炎炉沫浅法泄沽河沾泪沮
油泊沿泡注泣泞泻泌泳泥沸沼波泼泽治怔怯怖性怕怜怪怡学宝宗定宠宜审
宙官空帘宛实试郎诗肩房诚衬衫视祈话诞诡询该详建肃录隶帚屉居届刷屈
弧弥弦承孟陋陌孤陕降函限妹姑姐姓妮始姆迢驾叁参艰线练组绅细驶织驹
终驻绊驼绍绎经贯契贰奏春帮玷珍玲珊玻毒型拭挂封持拷拱项垮挎城挟挠
政赴赵挡拽哉挺括垢拴拾挑垛指垫挣挤拼挖按挥挪拯某甚荆茸革茬荐巷带
草茧茵茶荒茫荡荣荤荧故胡荫荔南药标栈柑枯柄栋相查柏栅柳柱柿栏柠树
勃要柬咸威歪研砖厘厚砌砂泵砚砍面耐耍牵鸥残殃轴轻鸦皆韭背战点虐临
览竖省削尝昧盹是盼眨哇哄哑显冒映星昨咧昭畏趴胃贵界虹虾蚁思蚂虽品
咽骂勋哗咱响哈哆咬咳咪哪哟炭峡罚贱贴贻骨幽钙钝钞钟钢钠钥钦钧钩钮
卸缸拜看矩毡氢怎牲选适秒香种秋科重复竿段便俩贷顺修俏保促俄俐侮俭
俗俘信皇泉鬼侵禹侯追俊盾待徊衍律很须叙剑逃食盆胚胧胆胜胞胖脉胎勉
狭狮独狰狡狱狠贸怨急饵饶蚀饺饼峦弯将奖哀亭亮度迹庭疮疯疫疤咨姿亲
音帝施闺闻闽阀阁差养美姜叛送类迷籽娄前首逆兹总炼炸烁炮炫烂剃洼洁
洪洒柒浇浊洞测洗活派洽染洛浏济洋洲浑浓津恃恒恢恍恬恤恰恼恨举觉宣
宦室宫宪突穿窃客诫冠诬语扁袄祖神祝祠误诱诲说诵垦退既屋昼屏屎费陡
逊眉孩陨除险院娃姥姨姻娇姚娜怒架贺盈勇怠癸蚤柔垒绑绒结绕骄绘给绚
骆络绝绞骇统耕耘耗耙艳泰秦珠班素匿蚕顽盏匪捞栽捕埂捂振载赶起盐捎
捍捏埋捉捆捐损袁捌都哲逝捡挫换挽挚热恐捣壶捅埃挨耻耿耽聂恭莽莱莲
莫莉荷获晋恶莹莺真框梆桂桔栖档桐株桥桦栓桃格桩校核样根索哥速逗栗
贾酌配翅辱唇夏砸砰砾础破原套逐烈殊殉顾轿较顿毙致柴桌虑监紧党逞晒
眠晓哮唠鸭晃哺晌剔晕蚌畔蚣蚊蚪蚓哨哩圃哭哦恩鸯唤唁哼唧啊唉唆罢峭
峨峰圆峻贼贿赂赃钱钳钻钾铁铃铅缺氧氨特牺造乘敌秤租积秧秩称秘透笔
笑笋债借值倚俺倾倒倘俱倡候赁俯倍倦健臭射躬息倔徒徐殷舰舱般航途拿
耸爹舀爱豺豹颁颂翁胰脆脂胸胳脏脐胶脑脓逛狸狼卿逢鸵留鸳皱饿馁凌凄
恋桨浆衰衷高郭席准座症病疾斋疹疼疲脊效离紊唐瓷资凉站剖竞部旁旅畜
阅羞羔瓶拳粉料益兼烤烘烦烧烛烟烙递涛浙涝浦酒涉消涡浩海涂浴浮涣涤
流润涧涕浪浸涨烫涩涌悖悟悄悍悔悯悦害宽家宵宴宾窍窄容宰案请朗诸诺
读扇诽袜袖袍被祥课冥谁调冤谅谆谈谊剥恳展剧屑弱陵祟陶陷陪娱娟恕娥
娘能难预桑绢绣验继骏球琐理琉琅捧堵措描域捺掩捷排焉掉捶赦堆推埠掀
授捻教掏掐掠掂培接掷控探据掘掺职基聆勘聊娶著菱勒黄菲萌萝菌萎菜萄
菊菩萍菠萤营乾萧萨菇械彬梦婪梗梧梢梅检梳梯桶梭救曹副票酝酗厢戚硅
硕奢盔爽聋袭盛匾雪辅辆颅虚彪雀堂常眶匙晨睁眯眼悬野啪啦曼晦晚啄啡
距趾啃跃略蚯蛀蛇唬累鄂唱患啰唾唯啤啥啸崖崎崭逻崔帷崩崇崛婴圈铐铛
铝铜铭铲银矫甜秸梨犁秽移笨笼笛笙符第敏做袋悠偿偶偎偷您售停偏躯兜
假衅徘徙得衔盘舶船舵斜盒鸽敛悉欲彩领脚脖脯豚脸脱象够逸猜猪猎猫凰
猖猛祭馅馆凑减毫烹庶麻庵痊痒痕廊康庸鹿盗章竟商族旋望率阎阐着羚盖
眷粘粗粒断剪兽焊焕清添鸿淋涯淹渠渐淑淌混淮淆渊淫渔淘淳液淤淡淀深
涮涵婆梁渗情惜惭悼惧惕惟惊惦悴惋惨惯寇寅寄寂宿窒窑密谋谍谎谐袱祷
祸谓谚谜逮敢尉屠弹隋堕随蛋隅隆隐婚婶婉颇颈绩绪续骑绰绳维绵绷绸综
绽绿缀巢琴琳琢琼斑替揍款堪塔搭堰揩越趁趋超揽堤提博揭喜彭揣插揪搜
煮援搀裁搁搓搂搅壹握搔揉斯期欺联葫散惹葬募葛董葡敬葱蒋蒂落韩朝辜
葵棒棱棋椰植森焚椅椒棵棍椎棉棚棕棺榔椭惠惑逼粟棘酣酥厨厦硬硝确硫
雁殖裂雄颊雳暂雅翘辈悲紫凿辉敞棠赏掌晴睐暑最晰量鼎喷喳晶喇遇喊遏
晾景畴践跋跌跑跛遗蛙蛛蜓蜒蛤喝鹃喂喘喉喻啼喧嵌幅帽赋赌赎赐赔黑铸
铺链销锁锄锅锈锋锌锐甥掰短智氮毯氯鹅剩稍程稀税筐等筑策筛筒筏答筋
筝傲傅牌堡集焦傍储皓皖粤奥街惩御循艇舒逾番释禽腊脾腋腔腕鲁猩猬猾
猴惫然馈馋装蛮就敦斌痘痢痪痛童竣阔善翔羡普粪尊奠道遂曾焰港滞湖湘
渣渤渺湿温渴溃溅滑湃渝湾渡游滋渲溉愤慌惰愕愣惶愧愉慨割寒富寓窜窝
窖窗窘遍雇裕裤裙禅禄谢谣谤谦犀属屡强粥疏隔隙隘媒絮嫂媚婿登缅缆缉
缎缓缔缕骗编骚缘瑟鹉瑞瑰瑙魂肆摄摸填搏塌鼓摆携搬摇搞塘摊聘斟蒜勤
靴靶鹊蓝墓幕蓬蓄蒲蓉蒙蒸献椿禁楚楷榄想槐榆楼概赖酪酬感碍碘碑碎碰
碗碌尴雷零雾雹辐辑输督频龄鉴睛睹睦瞄睫睡睬嗜鄙嗦愚暖盟歇暗暇照畸
跨跷跳跺跪路跤跟遣蜈蜗蛾蜂蜕嗅嗡嗓署置罪罩蜀幌错锚锡锣锤锥锦键锯
锰矮辞稚稠颓愁筹签简筷毁舅鼠催傻像躲魁衙微愈遥腻腰腥腮腹腺鹏腾腿
鲍猿颖触解煞雏馍馏酱禀痹廓痴痰廉靖新韵意誊粮数煎塑慈煤煌满漠滇源
滤滥滔溪溜漓滚溢溯滨溶溺粱滩慎誉塞寞窥窟寝谨褂裸福谬群殿辟障媳嫉
嫌嫁叠缚缝缠缤剿静碧璃赘熬墙墟嘉摧赫截誓境摘摔撇聚慕暮摹蔓蔑蔡蔗
蔽蔼熙蔚兢模槛榴榜榨榕歌遭酵酷酿酸碟碱碳磁愿需辖辗雌裳颗瞅墅嗽踊
蜻蜡蝇蜘蝉嘛嘀赚锹锻镀舞舔稳熏箕算箩管箫舆僚僧鼻魄魅貌膜膊膀鲜疑
孵馒裹敲豪膏遮腐瘩瘟瘦辣彰竭端旗精粹歉弊熄熔煽潇漆漱漂漫滴漾演漏
慢慷寨赛寡察蜜寥谭肇褐褪谱隧嫩翠熊凳骡缩慧撵撕撒撩趣趟撑撮撬播擒
墩撞撤增撰聪鞋鞍蕉蕊蔬蕴横槽樱橡樟橄敷豌飘醋醇醉磕磊磅碾震霄霉瞒
题暴瞎嘻嘶嘲嘹影踢踏踩踪蝶蝴蝠蝎蝌蝗蝙嘿嘱幢墨镇镐镑靠稽稻黎稿稼
箱篓箭篇僵躺僻德艘膝膛鲤鲫熟摩褒瘪瘤瘫凛颜毅糊遵憋潜澎潮潭鲨澳潘
澈澜澄懂憔懊憎额翩褥谴鹤憨慰劈履豫缭撼擂操擅燕蕾薯薛薇擎薪薄颠翰
噩橱橙橘整融瓢醒霍霎辙冀餐嘴踱蹄蹂蟆螃器噪鹦赠默黔镜赞穆篮篡篷篱
儒邀衡膨雕鲸磨瘾瘸凝辨辩糙糖糕燃濒澡激懒憾懈窿壁避缰缴戴擦藉鞠藏
藐檬檐檀礁磷霜霞瞭瞧瞬瞳瞩瞪曙蹋蹈螺蟋蟀嚎赡穗魏簧簇繁徽爵朦臊鳄
癌辫赢糟糠燥懦豁臀臂翼骤藕鞭藤覆瞻蹦嚣镰翻鳍鹰瀑襟璧戳孽警蘑藻攀
曝蹲蹭蹬巅簸簿蟹颤靡癣瓣羹鳖爆疆鬓壤馨耀躁蠕嚼嚷巍籍鳞魔糯灌譬蠢
霸露霹躏黯髓赣囊镶瓤罐矗乂乜兀弋孑孓幺亓韦廿丏卅仄厄仃仉仂兮刈爻
卞闩讣尹夬爿毋邗邛艽艿札叵匝丕匜劢卟叱叻仨仕仟仡仫仞卮氐犰刍邝邙
汀讦讧讪讫尻阡尕弁驭匡耒玎玑邢圩圬圭扦圪圳圹扪圮圯芊芍芄芨芑芎芗
亘厍夼戍尥乩旯曳岌屺凼囡钇缶氘氖牝伎伛伢佤仵伥伧伉伫囟氽汆刖夙旮
刎犷犸舛凫邬汕汔汐汲汜汊忖忏讴讵祁讷聿艮厾阱阮阪丞妁牟纡纣纥纨玕
玙抟抔扽圻坂坍坞抃抉芫邯芸芾苈苣芷芮苋芼苌苁芩芪芡芟苄苎苡杌杓杞
杈忑孛邴邳矶奁豕忒欤轫迓邶忐卣邺旰呋呒呓呔呖呃旸吡町虬呗吽吣吲帏
岐岈岘岑岚兕囵囫钊钋钌迕氙氚牤佞邱攸佚佝佟佗伽彷佘佥孚豸坌肟邸奂
劬狄狁鸠邹饨饩饪饫饬亨庑庋疔疖肓闱闳闵羌炀沣沅沔沤沌沏沚汩汨沂汾
沨汴汶沆沩泐怃怄忡忤忾怅忻忪怆忭忸诂诃诅诋诌诏诒孜陇陀陂陉妍妩妪
妣妊妗妫妞姒妤邵劭刭甬邰纭纰纴纶纾玮玡玭玠玢玥玦盂忝匦坩抨拤拈垆
抻劼拃拊坼坻坨坭抿坳耶苷苯苤茏苫苜苴苒苘茌苻苓茚茆茑茓茔茕茀苕枥
枇杪杳枧杵枨枞枋杻杷杼矸砀刳奄瓯殁郏轭郅鸢盱昊昙杲昃咂呸昕昀旻昉
炅咔畀虮咀呷黾呱呤咚咆咛呶呣呦咝岢岿岬岫帙岣峁刿迥岷剀帔峄沓囹罔
钍钎钏钒钕钗邾迮牦竺迤佶佬佰侑侉臾岱侗侃侏侩佻佾侪佼佯侬帛阜侔徂
舠刽郄怂籴瓮戗肼肽肱肫剁迩郇狙狎狍狒咎炙枭饯饴冽冼庖疠疝疡兖妾劾
炜炖炘炝炔泔沭泷泸泱泅泗泠泺泖泫泮沱泯泓泾怙怵怦怛怏怍㤘怩怫怿宕
穹宓诓诔诖诘戾诙戽郓衩祆祎祉祇祊诛诜诟诠诣诤诧诨诩戕孢亟陔妲妯姗
帑弩孥驽虱迦迨绀绁绂驷驸绉绌驿骀甾珏珐珂珑玳珀顸珉珈拮垭挝垣挞垤
赳贲垱垌挢郝垧垓挦垠茜荚荑贳荜莒茼茴茱莛荞茯荏荇荃荟荀茗荠茭茨垩
荥荦荨荩剋荪茹荬柰栉柯柘栊柩枰栌柙枵柚枳柞柝栀柢栎枸柈柁枷柽剌酊
郦甭砗砘砒斫砭砜奎耷虺殂殇殄殆轱轲轳轶轸虿毖觇尜哐眄眍郢眇眊眈禺
哂咴曷昴昱昵咦哓哔畎毗呲胄畋畈虼虻盅咣哕剐郧咻囿咿哌哙哚咯咩咤哝
哏哞峙峣罘帧峒峤峋峥贶钚钛钡钣钤钨钫钯氡氟牯郜秕秭竽笈笃俦俨俅俪
叟垡牮俣俚皈俑俟逅徇徉舢俞郗俎郤爰郛瓴胨胪胛胂胙胍胗胝朐胫鸨匍狨
狯飑狩狲訇逄昝饷饸饹胤孪娈弈奕庥疬疣疥疭庠竑彦飒闼闾闿阂羑迸籼酋
炳炻炽炯烀炷烃洱洹洧洌浃浈洇洄洙涎洎洫浍洮洵浒浔浕洳恸恓恹恫恺恻
恂恪恽宥扃衲衽衿袂祛祜祓祚诮祗祢诰诳鸩昶郡咫弭牁胥陛陟娅姮娆姝姣
姘姹怼羿炱矜绔骁骅绗绛骈耖挈珥珙顼珰珩珧珣珞琤珲敖恚埔埕埘埙埚挹
耆耄埒捋贽垸捃盍荸莆莳莴莪莠莓莜莅荼莩荽莸荻莘莎莞䓖莨鸪莼栲栳郴
桓桡桎桢桤梃栝桕桁桧桅栟桉栩逑逋彧鬲豇酐逦厝孬砝砹砺砧砷砟砼砥砣
剞砻轼轾辂鸫趸龀鸬虔逍眬唛晟眩眙哧哽唔晁晏鸮趵趿畛蚨蚜蚍蚋蚬蚝蚧
唢圄唣唏盎唑崂崃罡罟峪觊赅钰钲钴钵钹钺钽钼钿铀铂铄铆铈铉铊铋铌铍
铎氩氤氦毪舐秣秫盉笄笕笊笏笆俸倩俵偌俳俶倬倏恁倭倪俾倜隼隽倌倥臬
皋郫倨衄颀徕舫釜奚衾胯胱胴胭脍胼朕脒胺鸱玺鸲狷猁狳猃狺逖桀袅饽凇
栾挛亳疳疴疸疽痈疱痂痉衮凋颃恣旆旄旃阃阄訚阆恙粑朔郸烜烨烩烊剡郯
烬涑浯涞涟娑涅涠浞涓浥涔浜浠浣浚悚悭悝悒悌悛宸窈剜诹冢诼袒袢祯诿
谀谂谄谇屐屙陬勐奘牂蚩陲姬娠娌娉娲娩娴娣娓婀畚逡绠骊绡骋绥绦绨骎
邕鸶彗耜焘舂琏琇麸揶埴埯捯掳掴埸埵赧埤捭逵埝堋堍掬鸷掖捽掊堉掸捩
掮悫埭埽掇掼聃菁萁菘堇萘萋菽菖萜萸萑棻菔菟萏萃菏菹菪菅菀萦菰菡梵
梿梏觋桴桷梓棁桫棂啬郾匮敕豉鄄酞酚戛硎硭硒硖硗硐硇硌鸸瓠匏厩龚殒
殓殍赉雩辄堑眭眦啧晡晤眺眵眸圊喏喵啉勖晞唵晗冕啭畦趺啮跄蚶蛄蛎蛆
蚰蛊圉蚱蛉蛏蚴啁啕唿啐唼唷啖啵啶啷唳啜帻崚崦帼崮崤崆赇赈赊铑铒铗
铙铟铠铡铢铣铤铧铨铩铪铫铬铮铯铰铱铳铵铷氪牾鸹秾逶笺筇笸笪笮笠笥
笤笳笾笞偾偃偕偈傀偬偻皑皎鸻徜舸舻舴舷龛翎脬脘脲匐猗猡猞猝斛猕馗
馃馄鸾孰庹庾痔痍疵翊旌旎袤阇阈阉阊阋阍阏羟粝粕敝焐烯焓烽焖烷焗渍
渚淇淅淞渎涿淖挲淠涸渑淦淝淬涪淙涫渌淄惬悻悱惝惘悸惆惚惇惮窕谌谏
扈皲谑裆袷裉谒谔谕谖谗谙谛谝逯郿隈粜隍隗婧婊婕娼婢婵胬袈翌恿欸绫
骐绮绯绱骒绲骓绶绺绻绾骖缁耠琫琵琶琪瑛琦琥琨靓琰琮琯琬琛琚辇鼋揳
堞搽揸揠堙趄揖颉塄揿耋揄蛩蛰塆摒揆掾聒葑葚靰靸葳葺葸萼葆葩葶蒌萱
戟葭楮棼椟棹椤棰赍椋椁椪棣椐鹁覃酤酢酡鹂厥殚殛雯雱辊辋椠辍辎斐睄
睑睇睃戢喋嗒喃喱喹晷喈跖跗跞跚跎跏跆蛱蛲蛭蛳蛐蛔蛞蛴蛟蛘喁喟啾嗖
喑嗟喽嗞喀喔喙嵘嵖崴遄詈嵎崽嵬嵛嵯嵝嵫幄嵋铻铼铿锃锂锆锇锉锏锑锒
锔锕掣矬氰毳毽犊犄犋鹄犍嵇黍稃稂筚筵筌傣傈舄牍傥傧遑傩遁徨媭畲弑
颌翕釉鹆舜貂腈腌腓腆腴腑腚腱鱿鲀鲂颍猢猹猥飓觞觚猱颎飧馇馊亵脔裒
痣痨痦痞痤痫痧赓竦瓿啻颏鹇阑阒阕粞遒孳焯焜焙焱鹈湛渫湮湎湜渭湍湫
溲湟溆湲湔湉渥湄滁愠惺愦惴愀愎愔喾寐谟扉裢裎裥祾祺谠幂谡谥谧遐孱
弼巽骘媪媛婷巯翚皴婺骛缂缃缄彘缇缈缌缑缒缗飨耢瑚瑁瑜瑗瑄瑕遨骜韫
髡塬鄢趔趑摅摁蜇搋搪搐搛搠摈彀搦搡蓁戡蓍鄞靳蓐蓦鹋蒽蓓蓖蓊蒯蓟蓑
蒿蒺蓠蒟蒡蒹蒴蒗蓥颐楔楠楂楝楫楸椴槌楯皙榈槎榉楦楣楹椽裘剽甄酮酰
酯酩蜃碛碓硼碉碚碇碜鹌辏龃龅訾粲虞睚嗪韪嗷嗉睨睢雎睥嘟嗑嗫嗬嗔嗝
戥嗄煦暄遢暌跬跶跸跐跣跹跻蛸蜊蜍蜉蜣畹蛹嗣嗯嗥嗲嗳嗌嗨嗐嗤嗵罨嵊
嵩嵴骰锗锛锜锝锞锟锢锨锩锭锱雉氲犏歃稞稗稔筠筢筮筲筱牒煲敫徭愆艄
觎毹貊貅貉颔腠腩腼腭腧塍媵詹鲅鲆鲇鲈稣鲋鲐肄鹐飕觥遛馐鹑亶瘃痱痼
痿瘐瘁瘆麂裔歆旒雍阖阗阙羧豢粳猷煳煜煨煅煊煸煺滟溱溘漭滢溥溧溽裟
溻溷滗滫溴滏滃滦溏滂滓溟滪愫慑慄慊鲎骞窦窠窣裱褚裨裾裰禊谩谪媾嫫
媲嫒嫔媸缙缜缛辔骝缟缡缢缣骟耥璈瑶瑭獒觏慝嫠韬叆髦摽墁撂摞撄翥踅
摭墉墒榖毂綦蔫蔷靺靼鞅靿甍蔸蔟蔺戬蕖蔻蓿斡鹕蓼榛榧榻榫榭槔榱槁槟
槠榷僰酽酶酹厮碡碴碣碲磋臧豨殡霆霁辕蜚裴翡龇龈睿睽嘞嘈嘌嘁嘎暧暝
踌踉蜞蜥蜮蝈蜴蜱蜩蜷蜿螂蜢嘘嘡鹗嘣嘤嘚嗾嘧罴罱幔嶂幛赙罂骷骶鹘锲
锴锶锷锸锵镁镂犒箐箦箧箍箸箬箅箪箔箜箢箓毓僖儆僳僭劁僮魃魆睾艋鄱
膈膑鲑鲔鲚鲛鲟獐觫雒夤馑銮塾麽瘌瘊瘘瘙廖韶旖膂阚鄯鲞粼粽糁槊鹚熘
熥潢漤漕滹漯漶潋潴漪漉漳漩澉潍慵搴窨寤綮谮褡褙褓褛褊谯谰谲暨屣鹛
嫣嫱嫖嫦嫚嫘嫡鼐翟瞀鹜骠缥缦缧缨骢缪缫耦耧瑾璜璀璎璁璋璇奭髯髫撷
撅赭撸鋆撙撺墀聩觐鞑蕙鞒蕈蕨蕤蕞蕺瞢蕃蕲赜槿樯槭樗樘樊槲醌醅靥魇
餍磔磙霈辘亍彳邒卬殳毌邘戋圢氕伋仝氿汈氾忉宄讱玐扞圲圫芏芃朳朸邨
吒吖屼屾辿钆仳伣伈癿甪邠犴冱邡闫闬汋䜣讻孖纩玗玒玔玓玘玚坜坉坋扺
毐芰芣苊苉芘芴芠芤杕杙杄杋杧杩尪尨轪坒芈旴旵呙岍岠岜呇冏觃岙伾㑇
伭佖佁肜飏狃疕闶汧汫沄沘汭沕沇忮忳忺祃诇邲诎诐屃岊阽阼妌妧妘姂纮
驲纻纼玤玞玪玱玟邽邿坫坥坰坬坽弆耵苼茋苧苾苠枅㭎枘枍厔矼矻匼旿昇
昄昒昈甽咉咇咍岵岽岨岞峂囷钐钔钖牥佴垈侁侹佸佺隹侂佽侘郈郐郃攽肭
肸肷狉狝饳忞於並炌炆泙沺泂泜泃泇怊峃穸祋鸤弢弨陑陎卺乸妭妰姈妼迳
叕驵驺绋绐砉耔玵玶珇珅珃玽珋玸玹珌玿韨垚垯垙垲埏垍耇垎垴垟垞挓垏
拶荖荁荙荛茈茽荄茺荓茳茛荭柷柃柊枹栐柖郙郚剅䴓迺厖砆砑砄耏奓䶮轵
轷轹轺昺昽盷咡咺昳昣哒昤昫昡咥昪虷虸哃峘峏峛峗峧帡钘钜钪钬钭矧秬
俫舁俜俙俍垕衎舣弇侴鸧胠胈胩胣朏飐訄饻庤疢炣炟洭洘洓洏洿泚浉洸洑
洢洈洚洺洨浐洴洣恔宬窀扂袆祏祐祕叚陧陞娀姞姱娍姯姤姶姽枲绖骃彖骉
恝珪珬珛珹玼珖珚珽珦珘珨珫珒珢珕珝埗垾垺埆垿埌埇莰茝鄀莶莝莙栻桠
梜桄梠栴梴栒栘酎酏砵砠砫砬硁恧翃郪辀辁剕赀哢晅晊唝哳哱冔晔晐晖畖
蚄蚆帱崁峬峿崄帨崀赆钷眚甡笫倻倴脩倮倕倞倓倧衃虒舭舯舥瓞鬯鸰脎朓
胲虓鱽狴峱狻眢勍痄疰痃竘羖羓桊敉烠烔烶烻烅烑涍浡浬涄涢涐浰浟浛浼
浲浵浫涘悈悃悢宧窅窊窎扅扆袪袗袯祧隺堲疍陴烝娪娏砮哿翀翂剟绤骍琎
珸珵琄琈琀琂珶珺掭堎堐埼掎埫堌晢掞埪壸聍菝萚菥莿勚萆菂菍菼萣菉梼
梽桲梾桯梣梌桹敔厣硔硙硃硚硊硍勔龁祡砦逴唪晘翈晙畤趼跂蛃蚲蚺啴崧
崟崞崒崌崡铏铕铖铘铚铞铥铦铴牻牿稆笱笣笯偡鸺偭偲偁鄅偓徛衒舳舲鸼
悆鄃瓻脶脞脟鱾猇猊猄觖庱庼庳痓䴔竫堃羝羕焆烿烺焌渶淏淟淜淴淯湴涴
惛惔悰惙寁逭袼裈祲谞艴弸弶隃婞娵婼媖婳婍婌婋婫婩婇婤婘婠娽娺绹骕
絜珷琲琡琟琗琔琭堾堼揕堧喆揾堨塅堠絷堟葜惎萳葙靬葴蒇蒈鄚蒉蓇萩蒐
葰葎葹鄑蒎葖蒄萹棤棽棫椓椢椑鹀椆棓棬棪椀楗盚甦酦觌奡皕硪欹詟辌棐
龂黹牚睎晫晪晱蛑畯斝喤崶嵁嵽崾嵅崿嵚翙圌圐䞍赑淼赒铹铽锊锍锎锓犇
颋稌筀筘筜筥筅傃傉翛傒傕舾畬殽脿腘腙腒鲃猰猯馉凓鄗廋廆鄌粢遆旐焞
欻溚溁湝渱渰湓渟湙溠渼溇湣湑溞愐愃敩甯棨扊裣祼隞婻媙媔媆媞媓媂媄
媥媃毵矞缊缐骙瑃瑓瑅瑆䴖瑖瑝瑔瑀瑳瑏瑂嶅瑈瑑遘髢塥堽赪摛塝搒搌蒱
蒨蓏蔀蓢蓂蒻蓣椹楪榃榅楒楞楩榇椸楙歅碃碏碈硿鄠辒龆觜暕鹍暅跱蜐蜎
嵲赗骱锖锘锳锧锪锫锬稑稙筻筼筶筤傺鹎僇艅艉谼貆腽腨腯鲉鲊鲌鲏雊猺
飔觟馌裛廒瘀瘅鄘鹒鄜麀鄣阘煁煃煴煋煟煓滠溍溹滆滉溦溵漷滧滘滍愭慥
慆塱裼禋禔禘禒谫鹔愍嫃嫄媱戤勠戣耤瑧瑨瑱瑷瑢斠摏墈墐墘摴銎墚撖靽
鞁蔌蔈蓰蔹蔊嘏榰榑槚槜榍樋疐酺酾酲酴碶碨碹碥劂夥瞍鹖跽蜾幖嶍圙锺
锼锽锾锿镃镄镅馝箨箖劄僬僦僔躴僎槃鲒鲕鲖鲘鲙夐獍飗凘廑廙瘗瘥瘕鄫
熇漹潆潩漼漴漈漋漻慬窬窭褕禛禚隩嫤嫕嫭嫜嫪麹璆漦叇墣墦墡劐薁蕰蔃
鼒槱鹝磏磉殣慭霅暳暵暲暶曏踦踣蝘蝲蝤噇噂噀罶嶲嶓嶟嶒镆镈镋镎镕稹
篊儇皞皛艎艏鹟鲦鲪鲬橥觭鹠鹡糇糈翦鹢鹣熛潖潵澛瑬潾潏憭憕戭褯禤嫽
嬁遹璥璲璒憙擐鄹薳鞔黇蕗薐薢蕹橞橑橦醑瑿觱磡磜豮鹾虤暿曔暻曌曈蹅
踶螗疁幪嶦馞穄篚篯簉鼽衠盦螣縢鲭ê鲯鲰鲺鲹亸癀瘭羱糒燋熻燊燚燏濩濛
濋澪澽澴澭澼憷憺懔黉嬛嬚鹨翯璱瓁璬璮髽擿盩薿薸檑櫆檞醨繄磹磻瞫瞵
蹐蟏㘎镤镥镨矰穙穜穟簕簃簏儦魋斶艚谿臁鲾鳁鳂鳈鳉獯馘襕襚螱甓嬬嬥
瓀瓋瓍璻釐鬶爇鞳鞮藟藦藨鹲檽檫黡礞礌蹢蹜蟫嚚髃镮镱酂馧簠簝簰鼫鼩
皦臑䲢鳑鳒鹱鹯癗旞翷冁瀔瀍瀌襜瓃嚭酄鬷醭蹯蠋翾鳘儳儴鼗鳚鳛麑麖蠃
爅彟嬿瓌鬒蘶蘘欂醵颥甗巇酅髎犨黁爔瀱瀹瀼瀵襫孅骦耰瓖鬘趯礳罍鼱鳠
鳡爟爚爙灈韂糵蘼礵鹴躔皭龢鳤亹籥鼷玃醾齇觿蠼" ""))
  "常用汉字")

;; * Footer
(provide 'pyim-pymap)

;;; pyim-pymap.el ends here
